Autodesk.Revit.DB.FabricationHostedInfo.DisconnectFromHost
Disconnects the part from the host.
Since:
2016

Autodesk.Revit.DB.FabricationHostedInfo.GetBearerCenterline
Gets the centerline of the bearer. The method is applicable only for bearer hanger.
Returns:
The centerline of the bearer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The hanger is not a bearer hanger.
Since:
2017

Autodesk.Revit.DB.FabricationHostedInfo.PlaceOnHost(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Double)
Places the part on the specified host.
Remarks:
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
hostId:
Id of the host fabrication part.
hostConnector:
The connector of the host.
distance:
The distance from the connector to place the hosted part. Units are in feet (ft).
axisRotation:
The axis rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication part host. The host should be a straight fabrication part.
-or-
Invalid connector of fabrication part host.
-or-
The distance is out of range.
-or-
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.FabricationHostedInfo.PlaceOnHost(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double)
Places the part on the specified host.
Remarks:
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
hostId:
Id of the host fabrication part.
hostConnector:
The connector of the host.
distance:
The distance from the connector to place the hosted part. Units are in feet (ft).
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication part host. The host should be a straight fabrication part.
-or-
Invalid connector of fabrication part host.
-or-
The distance is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationHostedInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationHostedInfo.HostId
Returns the Id of the host.
Since:
2016

Autodesk.Revit.DB.FabricationHostedInfo
The fabrication hosted element information.
Remarks:
A fabrication part may have a host, the FabricationHostedInfo stores the host information for the fabrication part.
Since:
2016